load-tests/scenario.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 20
      arrivalRate: 5
      name: Startup phase
    - duration: 5
      arrivalRate: 20
      name: Peak phase
    - duration: 10
      arrivalRate: 2
      name: Slow-down phase
  plugins:
    ensure: {}
    expect: {}
  ensure:
    thresholds:
      - http.response_time.max: 200
    conditions:
      - expression: "http.codes.200 == http.requests"
scenarios:
  - flow:
      - get:
          url: "/health"
          capture:
            - json: "$.web.status"
              as: status
          expect:
            - equals:
                - "{{ status }}"
                - "up"
      - get:
          url: "/api/v1/about"
          capture:
            - json: "$.version"
              as: version
          expect:
            - equals:
                - "{{ version }}"
                - "0.0.2"
      - post:
          url: "/auth/sign-in"
          json:
            username: "johndoe"
            password: "MyBigSecret"
          expect:
            - statusCode: 200
      - post:
          url: "/auth/sign-out"
          expect:
            - statusCode: 204