load-tests/scenario.yaml
config:
  target: http://localhost:3000
  phases:
    - duration: 20
      arrivalRate: 5
      name: Startup phase
    - duration: 5
      arrivalRate: 20
      name: Peak phase
    - duration: 10
      arrivalRate: 2
      name: Slow-down phase
  plugins:
    ensure: {}
    expect: {}
  ensure:
    thresholds:
      - http.response_time.max: 200
scenarios:
  - flow:
      - get:
          url: "/health"
          capture:
            - json: "$.web.status"
              as: status
          expect:
            - equals:
                - "{{ status }}"
                - "up"
      - get:
          url: "/api/v1/about"
          capture:
            - json: "$.version"
              as: version
          expect:
            - equals:
                - "{{ version }}"
                - "0.0.3"
      - post:
          url: "/auth/sign-in"
          json:
            username: "admin"
            password: "MyBigSecret"
          expect:
            - statusCode: 200
      - get:
          url: "/api/v1/config"
          capture:
            - json: "$.isDevelopment"
              as: isDevelopment
          expect:
            - equals:
                - "{{ isDevelopment }}"
                - "false"
      - get:
          url: "/api/v1/users/me"
          capture:
            - json: "$.email"
              as: email
            - json: "$.role"
              as: role
            - json: "$.username"
              as: username
          expect:
            - equals:
                - "{{ email }}"
                - "admin@local.io"
            - equals:
                - "{{ role }}"
                - "admin"
            - equals:
                - "{{ username }}"
                - "admin"
      - post:
          url: "/auth/sign-out"
          expect:
            - statusCode: 204
      - get:
          url: "/api/v1/config"
          capture:
            - json: "$.error"
              as: error
            - json: "$.message"
              as: message
            - json: "$.statusCode"
              as: statusCode
          expect:
            - statusCode: 401
            - equals:
                - "{{ error }}"
                - "Unauthorized"
            - equals:
                - "{{ message }}"
                - "Unauthorized"
            - equals:
                - "{{ statusCode }}"
                - "401"
      - get:
          url: "/api/v1/users/me"
          capture:
            - json: "$.error"
              as: error
            - json: "$.message"
              as: message
            - json: "$.statusCode"
              as: statusCode
          expect:
            - statusCode: 401
            - equals:
                - "{{ error }}"
                - "Unauthorized"
            - equals:
                - "{{ message }}"
                - "Unauthorized"
            - equals:
                - "{{ statusCode }}"
                - "401"